1) {Ввод: матрица A}

2) Инициализация: m = [1; 1]

3) Проверка 1-ых строки и столбца на наличие 0:
 Проход по 1-ой строке:
	for j from 1 to n:
		if A[1][j] == 0:
			m[1] = 0
			break

Проход по 1-ому столбцу:
	for i from 1 to n:
		if A[i][1] == 0:
			m[2] = 0
			break

4) Проверка оставшейся части матрицы:
for j from 2 to n:
	for i from 2 to n:
		if A[i][j] == 0:
			A[1][j] = 0
			A[i][1] = 0

5) Зануление "плохих" строк и столбцов:
Проход по 1-ой строке:
	for j from 2 to n:
		if A[1][j] == 0:
			for i from 2 to n:
				A[i][j] = 0
Проход по 1-ому столбцу:
	for i from 2 to n:
		if A[i][1] == 0:
			for j from 2 to n:
				A[i][j] = 0

6) Проверка m:
if m[1] == 0:
	for j from 1 to n:
		A[1][j] = 0
if m[2] == 0:
	for i from 1 to n:
		A[i][1] = 0

Оценка сложности:
1) Память: O(1)
необходимо хранить 2 ячейки: m[1] и m[2]
2) Время: O(n^2)
3 пункт - O(n)
4 пункт - O(n^2)
5 пункт - O(n^2)
6 пункт - O(n)
